[GraphicalObject]
Name=DeconGUI
Path=
WndStyle=TOOLBAR
PosStyle=LEFTMOST
Caption=
X=0
Y=0
Width=150
Height=1200
Color=
Help=
RC-DLL=hpmsp008.dll

[ToolDescriptor]
1=Deconvolute, PUSHBUTTON , hpgbut02.dll
2=Options, PUSHBUTTON , hpgbut02.dll
3=Delete, PUSHBUTTON , hpgbut02.dll
4=Reset, PUSHBUTTON , hpgbut02.dll
5=Overlay, RADIOBUTTON , hpgbut02.dll
6=Separate, RADIOBUTTON , hpgbut02.dll
7=DeconvPrintPreview, PUSHBUTTON , hpgbut02.dll
8=DeconvPrint, PUSHBUTTON , hpgbut02.dll
9=DeconvClose, PUSHBUTTON , hpgbut02.dll
10=DeconvHelp, PUSHBUTTON , hpgbut02.dll
11=DecResultsTable, CHILDWND, hpgwct02.dll
12=SepLine1, GROUPFRAME , hpgbut02.dll
13=SepLine2, GROUPFRAME , hpgbut02.dll

[GroupFrame SepLine1]
x=0
y=0
width=148
height=4
FrameThickness=2

[GroupFrame SepLine2]
x=149
y=0
width=1
height=1200
Color=0,0,0
FrameThickness=0

[PushButton Deconvolute]
ImageList=RBMP.DECONVOLUTE|RBMP.DECONVOLUTE_DOWN|RBMP.DECONVOLUTE_DOWN
Group=1
x=36
y=12
width=40
height=40
Command=DEC_OnToolbarButton "Deconvolute"
Help=デコンボリューションの実行
FrameThickness=2

[PushButton Options]
ImageList=RBMP.DECONVOPTIONS|RBMP.DECONVOPTIONS_DOWN|RBMP.DECONVOPTIONS_DOWN
Group=1
x=76
y=12
width=40
height=40
Command=DEC_OnToolbarButton "Options"
Help=デコンボリューションオプション
FrameThickness=2

[PushButton Delete]
ImageList=RBMP.DECONVDELETE|RBMP.DECONVDELETE_DOWN|RBMP.DECONVDELETE_DOWN
Group=1
x=36
y=52
width=40
height=40
Command=DEC_OnToolbarButton "Delete"
Help=選択されたコンポーネントの削除
FrameThickness=2

[PushButton Reset]
ImageList=RBMP.DECONVRESET|RBMP.DECONVRESET_DOWN|RBMP.DECONVRESET_DOWN
Group=1
x=76
y=52
width=40
height=40
Command=DEC_OnToolbarButton "Reset"
Help=結果を消去して、もう一度やり直します
FrameThickness=2

[RadioButton Overlay]
ImageList=RBMP.SPECOVERLAY|RBMP.SPECOVERLAY_DOWN|RBMP.SPECOVERLAY_DISABLE
Group=42
x=36
y=112
width=40
height=40
Command=DEC_OnToolbarButton "Overlay"
Help=デコンボリューションされたイオンのセットを、重ね書きで表示します
FrameThickness=2

[RadioButton Separate]
ImageList=RBMP.SPECSEPARATE|RBMP.SPECSEPARATE_DOWN|RBMP.SPECSEPARATE_DISABLE
Group=42
x=76
y=112
width=40
height=40
Command=DEC_OnToolbarButton "Separate"
Help=デコンボリューションされたイオンのセットを別々に表示します
FrameThickness=2

[PushButton DeconvPrintPreview]
ImageList=RBMP.DECONVPRINTPREV|RBMP.DECONVPRINTPREV_DOWN|RBMP.DECONVPRINTPREV_DOWN
Group=1
x=36
y=152
width=40
height=40
Command=DEC_OnToolbarButton "DeconvPrintPreview"
Help=デコンボリューションレポートをプレビューします
FrameThickness=2

[PushButton DeconvPrint]
ImageList=RBMP.DECONVPRINT|RBMP.DECONVPRINT_DOWN|RBMP.DECONVPRINT_DOWN
Group=1
x=76
y=152
width=40
height=40
Command=DEC_OnToolbarButton "DeconvPrint"
Help=デコンボリューションレポートの印刷
FrameThickness=2

[PushButton DeconvClose]
ImageList=RBMP.DECONVCLOSE|RBMP.DECONVCLOSE_DOWN|RBMP.DECONVCLOSE_DOWN
Group=1
x=36
y=212
width=40
height=40
Command=DEC_OnToolbarButton "DeconvClose"
Help=デコンボリューションモードを閉じます
FrameThickness=2

[PushButton DeconvHelp]
ImageList=RBMP.DECONVHELP|RBMP.DECONVHELP_DOWN|RBMP.DECONVHELP_DOWN
Group=1
x=76
y=212
width=40
height=40
Command=DEC_OnToolbarButton "DeconvHelp"
Help=デコンボリューションに関するヘルプ
FrameThickness=2

[ChildWnd DecResultsTable]
x=0
y=262
width=148
height=110
CHILDDLL=hpgtw_01.dlc
CHILDCREATEFCT=GomTabCreate
CHILDNAME=DeconReg[1], MW, DeconvMWDDT, , CP,
; This window number must be hardcoded.  There is no way to
; set it dynamically.
CHILDREFERENCENO=72






